Revit 2027 API
ScheduleField.MultipleValuesDisplayType Property
 Determines the type of multiple value indication to be used when the schedule field displays multiple element values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleFieldMultipleValuesDisplayType MultipleValuesDisplayType { get; set; }
Public Property MultipleValuesDisplayType As ScheduleFieldMultipleValuesDisplayType
	Get
	Set
public:
property ScheduleFieldMultipleValuesDisplayType MultipleValuesDisplayType {
	ScheduleFieldMultipleValuesDisplayType get ();
	void set (ScheduleFieldMultipleValuesDisplayType value);
}
member MultipleValuesDisplayType : ScheduleFieldMultipleValuesDisplayType with get, set
Property Value
ScheduleFieldMultipleValuesDisplayType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The default display type is Project, indicating that the project [!:Autodesk::Revit::DB::MultipleValuesIndicationSettings::Value] setting will be used.
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace